stevenj/avr-libc3/include/avr/io/atmega16hvbrevb.h
/* CC-ADC Control and Status Register A-CADPOL */
typedef enum COULOMB_COUNTER_CADPOL_enum
{
    COULOMB_COUNTER_CADPOL_CLEAR_gc = (0x00), /* CC-ADC Control and Status Register A-CADPOL - CLEAR */
    COULOMB_COUNTER_CADPOL_SET_gc   = (0x40), /* CC-ADC Control and Status Register A-CADPOL - SET */
} COULOMB_COUNTER_CADPOL_t;

/* CC_ADC Update Busy */
typedef enum COULOMB_COUNTER_CADUB_enum
{
    COULOMB_COUNTER_CADUB_CLEAR_gc = (0x00), /* CC_ADC Update Busy - CLEAR */
    COULOMB_COUNTER_CADUB_SET_gc   = (0x20), /* CC_ADC Update Busy - SET */
} COULOMB_COUNTER_CADUB_t;

/* CC_ADC Accumulate Current Select Bits */
#define COULOMB_COUNTER_CADCSRA_CADAS_gc(x) ((x<<3) & 0x18)

/* The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined. */
#define COULOMB_COUNTER_CADCSRA_CADSI_gc(x) ((x<<1) & 0x06)

/* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. */
typedef enum COULOMB_COUNTER_CADSE_enum
{
    COULOMB_COUNTER_CADSE_CLEAR_gc = (0x00), /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - CLEAR */
    COULOMB_COUNTER_CADSE_SET_gc   = (0x01), /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - SET */
} COULOMB_COUNTER_CADSE_t;

/* CC-ADC Control and Status Register B-CADACIE */
typedef enum COULOMB_COUNTER_CADACIE_enum
{
    COULOMB_COUNTER_CADACIE_CLEAR_gc = (0x00), /* CC-ADC Control and Status Register B-CADACIE - CLEAR */
    COULOMB_COUNTER_CADACIE_SET_gc   = (0x40), /* CC-ADC Control and Status Register B-CADACIE - SET */
} COULOMB_COUNTER_CADACIE_t;

/* Regular Current Interrupt Enable */
typedef enum COULOMB_COUNTER_CADRCIE_enum
{
    COULOMB_COUNTER_CADRCIE_CLEAR_gc = (0x00), /* Regular Current Interrupt Enable - CLEAR */
    COULOMB_COUNTER_CADRCIE_SET_gc   = (0x20), /* Regular Current Interrupt Enable - SET */
} COULOMB_COUNTER_CADRCIE_t;

/* CAD Instantenous Current Interrupt Enable */
typedef enum COULOMB_COUNTER_CADICIE_enum
{
    COULOMB_COUNTER_CADICIE_CLEAR_gc = (0x00), /* CAD Instantenous Current Interrupt Enable - CLEAR */
    COULOMB_COUNTER_CADICIE_SET_gc   = (0x10), /* CAD Instantenous Current Interrupt Enable - SET */
} COULOMB_COUNTER_CADICIE_t;

/* CC-ADC Accumulate Current Interrupt Flag */
typedef enum COULOMB_COUNTER_CADACIF_enum
{
    COULOMB_COUNTER_CADACIF_CLEAR_gc = (0x00), /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
    COULOMB_COUNTER_CADACIF_SET_gc   = (0x04), /* CC-ADC Accumulate Current Interrupt Flag - SET */
} COULOMB_COUNTER_CADACIF_t;

/* CC-ADC Accumulate Current Interrupt Flag */
typedef enum COULOMB_COUNTER_CADRCIF_enum
{
    COULOMB_COUNTER_CADRCIF_CLEAR_gc = (0x00), /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
    COULOMB_COUNTER_CADRCIF_SET_gc   = (0x02), /* CC-ADC Accumulate Current Interrupt Flag - SET */
} COULOMB_COUNTER_CADRCIF_t;

/* CC-ADC Instantaneous Current Interrupt Flag */
typedef enum COULOMB_COUNTER_CADICIF_enum
{
    COULOMB_COUNTER_CADICIF_CLEAR_gc = (0x00), /* CC-ADC Instantaneous Current Interrupt Flag - CLEAR */
    COULOMB_COUNTER_CADICIF_SET_gc   = (0x01), /* CC-ADC Instantaneous Current Interrupt Flag - SET */
} COULOMB_COUNTER_CADICIF_t;

/* CC-ADC Voltage Scaling Enable */
typedef enum COULOMB_COUNTER_CADVSE_enum
{
    COULOMB_COUNTER_CADVSE_CLEAR_gc = (0x00), /* CC-ADC Voltage Scaling Enable - CLEAR */
    COULOMB_COUNTER_CADVSE_SET_gc   = (0x01), /* CC-ADC Voltage Scaling Enable - SET */
} COULOMB_COUNTER_CADVSE_t;

/* ADC accumulate current bits */
#define COULOMB_COUNTER_CADAC1_CADAC_gc(x) ((x<<2) & 0xFC)

/* ADC accumulate current bits */
#define COULOMB_COUNTER_CADAC1_CADAC0_gc(x) (x & 0x03)

/*
--------------------------------------------------------------------------------
TWI - Two Wire Serial Interface
--------------------------------------------------------------------------------
*/

typedef struct TWI_struct
{
    register8_t rsv_0x00[184]; /* RESERVED REGISTER BLOCK */
    register8_t TWBR;          /* TWI Bit Rate register */
    register8_t TWSR;          /* TWI Status Register */
    register8_t TWAR;          /* TWI (Slave) Address register */
    register8_t TWDR;          /* TWI Data register */
    register8_t TWCR;          /* TWI Control Register */
    register8_t TWAMR;         /* TWI (Slave) Address Mask Register */
    register8_t TWBCSR;        /* TWI Bus Control and Status Register */
} TWI_t;


/* TWI Bus Connect/Disconnect Interrupt Flag */
typedef enum TWI_TWBCIF_enum
{
    TWI_TWBCIF_CLEAR_gc = (0x00), /* TWI Bus Connect/Disconnect Interrupt Flag - CLEAR */
    TWI_TWBCIF_SET_gc   = (0x80), /* TWI Bus Connect/Disconnect Interrupt Flag - SET */
} TWI_TWBCIF_t;

/* TWI Bus Connect/Disconnect Interrupt Enable */
typedef enum TWI_TWBCIE_enum
{
    TWI_TWBCIE_CLEAR_gc = (0x00), /* TWI Bus Connect/Disconnect Interrupt Enable - CLEAR */
    TWI_TWBCIE_SET_gc   = (0x40), /* TWI Bus Connect/Disconnect Interrupt Enable - SET */
} TWI_TWBCIE_t;

/* TWI Bus Disconnect Time-out Period */
typedef enum TWI_TWBDT_enum
{
    TWI_TWBDT_VAL_0x00_gc = (0x00<<1), /* 250ms */
    TWI_TWBDT_VAL_0x01_gc = (0x01<<1), /* 500ms */
    TWI_TWBDT_VAL_0x02_gc = (0x02<<1), /* 1000ms */
    TWI_TWBDT_VAL_0x03_gc = (0x03<<1), /* 2000ms */
} TWI_TWBDT_t;

/* TWI Bus Connect/Disconnect Interrupt Polarity */
typedef enum TWI_TWBCIP_enum
{
    TWI_TWBCIP_CLEAR_gc = (0x00), /* TWI Bus Connect/Disconnect Interrupt Polarity - CLEAR */
    TWI_TWBCIP_SET_gc   = (0x01), /* TWI Bus Connect/Disconnect Interrupt Polarity - SET */
} TWI_TWBCIP_t;

/* TWI Interrupt Flag */
typedef enum TWI_TWINT_enum
{
    TWI_TWINT_CLEAR_gc = (0x00), /* TWI Interrupt Flag - CLEAR */
    TWI_TWINT_SET_gc   = (0x80), /* TWI Interrupt Flag - SET */
} TWI_TWINT_t;

/* TWI Enable Acknowledge Bit */
typedef enum TWI_TWEA_enum
{
    TWI_TWEA_CLEAR_gc = (0x00), /* TWI Enable Acknowledge Bit - CLEAR */
    TWI_TWEA_SET_gc   = (0x40), /* TWI Enable Acknowledge Bit - SET */
} TWI_TWEA_t;

