stevenj/avr-libc3/include/avr/io/atmega16hvbrevb.h
/* Timer/Counter0 Output Compare A Interrupt Enable */
typedef enum TC0_OCIE0A_enum
{
    TC0_OCIE0A_CLEAR_gc = (0x00), /* Timer/Counter0 Output Compare A Interrupt Enable - CLEAR */
    TC0_OCIE0A_SET_gc   = (0x02), /* Timer/Counter0 Output Compare A Interrupt Enable - SET */
} TC0_OCIE0A_t;

/* Timer/Counter0 Overflow Interrupt Enable */
typedef enum TC0_TOIE0_enum
{
    TC0_TOIE0_CLEAR_gc = (0x00), /* Timer/Counter0 Overflow Interrupt Enable - CLEAR */
    TC0_TOIE0_SET_gc   = (0x01), /* Timer/Counter0 Overflow Interrupt Enable - SET */
} TC0_TOIE0_t;

/* Timer/Counter 0 Input Capture Flag */
typedef enum TC0_ICF0_enum
{
    TC0_ICF0_CLEAR_gc = (0x00), /* Timer/Counter 0 Input Capture Flag - CLEAR */
    TC0_ICF0_SET_gc   = (0x08), /* Timer/Counter 0 Input Capture Flag - SET */
} TC0_ICF0_t;

/* Timer/Counter0 Output Compare Flag B */
typedef enum TC0_OCF0B_enum
{
    TC0_OCF0B_CLEAR_gc = (0x00), /* Timer/Counter0 Output Compare Flag B - CLEAR */
    TC0_OCF0B_SET_gc   = (0x04), /* Timer/Counter0 Output Compare Flag B - SET */
} TC0_OCF0B_t;

/* Timer/Counter0 Output Compare Flag A */
typedef enum TC0_OCF0A_enum
{
    TC0_OCF0A_CLEAR_gc = (0x00), /* Timer/Counter0 Output Compare Flag A - CLEAR */
    TC0_OCF0A_SET_gc   = (0x02), /* Timer/Counter0 Output Compare Flag A - SET */
} TC0_OCF0A_t;

/* Timer/Counter0 Overflow Flag */
typedef enum TC0_TOV0_enum
{
    TC0_TOV0_CLEAR_gc = (0x00), /* Timer/Counter0 Overflow Flag - CLEAR */
    TC0_TOV0_SET_gc   = (0x01), /* Timer/Counter0 Overflow Flag - SET */
} TC0_TOV0_t;

/* Timer/Counter Synchronization Mode */
typedef enum TC0_TSM_enum
{
    TC0_TSM_CLEAR_gc = (0x00), /* Timer/Counter Synchronization Mode - CLEAR */
    TC0_TSM_SET_gc   = (0x80), /* Timer/Counter Synchronization Mode - SET */
} TC0_TSM_t;

/* Prescaler Reset */
typedef enum TC0_PSRSYNC_enum
{
    TC0_PSRSYNC_CLEAR_gc = (0x00), /* Prescaler Reset - CLEAR */
    TC0_PSRSYNC_SET_gc   = (0x01), /* Prescaler Reset - SET */
} TC0_PSRSYNC_t;

/*
--------------------------------------------------------------------------------
CELL_BALANCING - Cell Balancing
--------------------------------------------------------------------------------
*/

typedef struct CELL_BALANCING_struct
{
    register8_t rsv_0x00[241]; /* RESERVED REGISTER BLOCK */
    register8_t CBCR;          /* Cell Balancing Control Register */
} CELL_BALANCING_t;


/*
--------------------------------------------------------------------------------
BATTERY_PROTECTION - Battery Protection
--------------------------------------------------------------------------------
*/

typedef struct BATTERY_PROTECTION_struct
{
    register8_t rsv_0x00[242]; /* RESERVED REGISTER BLOCK */
    register8_t BPIMSK;        /* Battery Protection Interrupt Mask Register */
    register8_t BPIFR;         /* Battery Protection Interrupt Flag Register */
    register8_t rsv_0xF4;      /* RESERVED REGISTER */
    register8_t BPSCD;         /* Battery Protection Short-Circuit Detection Level Register */
    register8_t BPDOCD;        /* Battery Protection Discharge-Over-current Detection Level Register */
    register8_t BPCOCD;        /* Battery Protection Charge-Over-current Detection Level Register */
    register8_t BPDHCD;        /* Battery Protection Discharge-High-current Detection Level Register */
    register8_t BPCHCD;        /* Battery Protection Charge-High-current Detection Level Register */
    register8_t BPSCTR;        /* Battery Protection Short-current Timing Register */
    register8_t BPOCTR;        /* Battery Protection Over-current Timing Register */
    register8_t BPHCTR;        /* Battery Protection Short-current Timing Register */
    register8_t BPCR;          /* Battery Protection Control Register */
    register8_t BPPLR;         /* Battery Protection Parameter Lock Register */
} BATTERY_PROTECTION_t;


/* Battery Protection Parameter Lock Enable */
typedef enum BATTERY_PROTECTION_BPPLE_enum
{
    BATTERY_PROTECTION_BPPLE_CLEAR_gc = (0x00), /* Battery Protection Parameter Lock Enable - CLEAR */
    BATTERY_PROTECTION_BPPLE_SET_gc   = (0x02), /* Battery Protection Parameter Lock Enable - SET */
} BATTERY_PROTECTION_BPPLE_t;

/* Battery Protection Parameter Lock */
typedef enum BATTERY_PROTECTION_BPPL_enum
{
    BATTERY_PROTECTION_BPPL_CLEAR_gc = (0x00), /* Battery Protection Parameter Lock - CLEAR */
    BATTERY_PROTECTION_BPPL_SET_gc   = (0x01), /* Battery Protection Parameter Lock - SET */
} BATTERY_PROTECTION_BPPL_t;

/* External Protection Input Disable */
typedef enum BATTERY_PROTECTION_EPID_enum
{
    BATTERY_PROTECTION_EPID_CLEAR_gc = (0x00), /* External Protection Input Disable - CLEAR */
    BATTERY_PROTECTION_EPID_SET_gc   = (0x20), /* External Protection Input Disable - SET */
} BATTERY_PROTECTION_EPID_t;

/* Short Circuit Protection Disabled */
typedef enum BATTERY_PROTECTION_SCD_enum
{
    BATTERY_PROTECTION_SCD_CLEAR_gc = (0x00), /* Short Circuit Protection Disabled - CLEAR */
    BATTERY_PROTECTION_SCD_SET_gc   = (0x10), /* Short Circuit Protection Disabled - SET */
} BATTERY_PROTECTION_SCD_t;

/* Discharge Over-current Protection Disabled */
typedef enum BATTERY_PROTECTION_DOCD_enum
{
    BATTERY_PROTECTION_DOCD_CLEAR_gc = (0x00), /* Discharge Over-current Protection Disabled - CLEAR */
    BATTERY_PROTECTION_DOCD_SET_gc   = (0x08), /* Discharge Over-current Protection Disabled - SET */
} BATTERY_PROTECTION_DOCD_t;

/* Charge Over-current Protection Disabled */
typedef enum BATTERY_PROTECTION_COCD_enum
{
    BATTERY_PROTECTION_COCD_CLEAR_gc = (0x00), /* Charge Over-current Protection Disabled - CLEAR */
    BATTERY_PROTECTION_COCD_SET_gc   = (0x04), /* Charge Over-current Protection Disabled - SET */
} BATTERY_PROTECTION_COCD_t;

/* Discharge High-current Protection Disable */
typedef enum BATTERY_PROTECTION_DHCD_enum
{
    BATTERY_PROTECTION_DHCD_CLEAR_gc = (0x00), /* Discharge High-current Protection Disable - CLEAR */
    BATTERY_PROTECTION_DHCD_SET_gc   = (0x02), /* Discharge High-current Protection Disable - SET */
} BATTERY_PROTECTION_DHCD_t;

/* Charge High-current Protection Disable */
typedef enum BATTERY_PROTECTION_CHCD_enum
{
    BATTERY_PROTECTION_CHCD_CLEAR_gc = (0x00), /* Charge High-current Protection Disable - CLEAR */
    BATTERY_PROTECTION_CHCD_SET_gc   = (0x01), /* Charge High-current Protection Disable - SET */
} BATTERY_PROTECTION_CHCD_t;

/* Short-circuit Protection Activated Interrupt Flag */
typedef enum BATTERY_PROTECTION_SCIF_enum
{
    BATTERY_PROTECTION_SCIF_CLEAR_gc = (0x00), /* Short-circuit Protection Activated Interrupt Flag - CLEAR */
    BATTERY_PROTECTION_SCIF_SET_gc   = (0x10), /* Short-circuit Protection Activated Interrupt Flag - SET */
} BATTERY_PROTECTION_SCIF_t;

/* Discharge Over-current Protection Activated Interrupt Flag */
typedef enum BATTERY_PROTECTION_DOCIF_enum
{
    BATTERY_PROTECTION_DOCIF_CLEAR_gc = (0x00), /* Discharge Over-current Protection Activated Interrupt Flag - CLEAR */
    BATTERY_PROTECTION_DOCIF_SET_gc   = (0x08), /* Discharge Over-current Protection Activated Interrupt Flag - SET */
} BATTERY_PROTECTION_DOCIF_t;

/* Charge Over-current Protection Activated Interrupt Flag */
typedef enum BATTERY_PROTECTION_COCIF_enum
{
    BATTERY_PROTECTION_COCIF_CLEAR_gc = (0x00), /* Charge Over-current Protection Activated Interrupt Flag - CLEAR */
    BATTERY_PROTECTION_COCIF_SET_gc   = (0x04), /* Charge Over-current Protection Activated Interrupt Flag - SET */
} BATTERY_PROTECTION_COCIF_t;

/* Disharge High-current Protection Activated Interrupt */
typedef enum BATTERY_PROTECTION_DHCIF_enum
{
    BATTERY_PROTECTION_DHCIF_CLEAR_gc = (0x00), /* Disharge High-current Protection Activated Interrupt - CLEAR */
    BATTERY_PROTECTION_DHCIF_SET_gc   = (0x02), /* Disharge High-current Protection Activated Interrupt - SET */
} BATTERY_PROTECTION_DHCIF_t;

/* Charge High-current Protection Activated Interrupt */
typedef enum BATTERY_PROTECTION_CHCIF_enum
{
    BATTERY_PROTECTION_CHCIF_CLEAR_gc = (0x00), /* Charge High-current Protection Activated Interrupt - CLEAR */
    BATTERY_PROTECTION_CHCIF_SET_gc   = (0x01), /* Charge High-current Protection Activated Interrupt - SET */
} BATTERY_PROTECTION_CHCIF_t;

/* Short-circuit Protection Activated Interrupt Enable */
typedef enum BATTERY_PROTECTION_SCIE_enum
{
    BATTERY_PROTECTION_SCIE_CLEAR_gc = (0x00), /* Short-circuit Protection Activated Interrupt Enable - CLEAR */
    BATTERY_PROTECTION_SCIE_SET_gc   = (0x10), /* Short-circuit Protection Activated Interrupt Enable - SET */
} BATTERY_PROTECTION_SCIE_t;

/* Discharge Over-current Protection Activated Interrupt Enable */
typedef enum BATTERY_PROTECTION_DOCIE_enum
{
    BATTERY_PROTECTION_DOCIE_CLEAR_gc = (0x00), /* Discharge Over-current Protection Activated Interrupt Enable - CLEAR */
    BATTERY_PROTECTION_DOCIE_SET_gc   = (0x08), /* Discharge Over-current Protection Activated Interrupt Enable - SET */
} BATTERY_PROTECTION_DOCIE_t;

