stevenj/avr-libc3/include/avr/io/atmega16hvbrevb.h
/* CPU - CPU Registers (0x0000) */
#define CPU_BASE                  _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_OSICSR                _SFR_MEM8 (0x0037) /* Oscillator Sampling Interface Control and Status Register */
#define CPU_GPIOR0                _SFR_MEM8 (0x003E) /* General Purpose IO Register 0 */
#define CPU_GPIOR1                _SFR_MEM8 (0x004A) /* General Purpose IO Register 1 */
#define CPU_GPIOR2                _SFR_MEM8 (0x004B) /* General Purpose IO Register 2 */
#define CPU_SMCR                  _SFR_MEM8 (0x0053) /* Sleep Mode Control Register */
#define CPU_MCUSR                 _SFR_MEM8 (0x0054) /* MCU Status Register */
#define CPU_MCUCR                 _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SP                    _SFR_MEM16(0x005D) /* Stack Pointer  */
#define CPU_SPL                   _SFR_MEM8 (0x005D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH                   _SFR_MEM8 (0x005E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG                  _SFR_MEM8 (0x005F) /* Status Register */
#define CPU_CLKPR                 _SFR_MEM8 (0x0061) /* Clock Prescale Register */
#define CPU_PRR0                  _SFR_MEM8 (0x0064) /* Power Reduction Register 0 */
#define CPU_FOSCCAL               _SFR_MEM8 (0x0066) /* Fast Oscillator Calibration Value */
#define CPU_DIDR0                 _SFR_MEM8 (0x007E) /* Digital Input Disable Register */

/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE               _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA               _SFR_MEM8 (0x0020) /* Port A Input Pins */
#define PORTAA_DDRA               _SFR_MEM8 (0x0021) /* Port A Data Direction Register */
#define PORTAA_PORTA              _SFR_MEM8 (0x0022) /* Port A Data Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE               _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB               _SFR_MEM8 (0x0023) /* Port B Input Pins */
#define PORTBB_DDRB               _SFR_MEM8 (0x0024) /* Port B Data Direction Register */
#define PORTBB_PORTB              _SFR_MEM8 (0x0025) /* Port B Data Register */

/* PORTC - I/O Port (0x0000) */
#define PORTCC_BASE               _SFR_MEM8 (0x0000) /* PORTCC Base Address */
#define PORTCC_PINC               _SFR_MEM8 (0x0026) /* Port C Input Pins */
#define PORTCC_PORTC              _SFR_MEM8 (0x0028) /* Port C Data Register */

/* BOOT_LOAD - Bootloader (0x0000) */
#define BOOT_LOAD_BASE            _SFR_MEM8 (0x0000) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR          _SFR_MEM8 (0x0057) /* Store Program Memory Control and Status Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE                 _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW                  _SFR_MEM8 (0x0000) 
#define FUSE_HIGH                 _SFR_MEM8 (0x0001) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE              _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT           _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num         (0)                 
#define None_RESET_vect             _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset */
#define None_BPINT_vect_num         (1)                 
#define None_BPINT_vect             _VECTOR(1)          /* Battery Protection Interrupt */
#define None_VREGMON_vect_num       (2)                 
#define None_VREGMON_vect           _VECTOR(2)          /* Voltage regulator monitor interrupt */
#define None_INT0_vect_num          (3)                 
#define None_INT0_vect              _VECTOR(3)          /* External Interrupt Request 0 */
#define None_INT1_vect_num          (4)                 
#define None_INT1_vect              _VECTOR(4)          /* External Interrupt Request 1 */
#define None_INT2_vect_num          (5)                 
#define None_INT2_vect              _VECTOR(5)          /* External Interrupt Request 2 */
#define None_INT3_vect_num          (6)                 
#define None_INT3_vect              _VECTOR(6)          /* External Interrupt Request 3 */
#define None_PCINT0_vect_num        (7)                 
#define None_PCINT0_vect            _VECTOR(7)          /* Pin Change Interrupt 0 */
#define None_PCINT1_vect_num        (8)                 
#define None_PCINT1_vect            _VECTOR(8)          /* Pin Change Interrupt 1 */
#define None_WDT_vect_num           (9)                 
#define None_WDT_vect               _VECTOR(9)          /* Watchdog Timeout Interrupt */
#define None_BGSCD_vect_num         (10)                
#define None_BGSCD_vect             _VECTOR(10)         /* Bandgap Buffer Short Circuit Detected */
#define None_CHDET_vect_num         (11)                
#define None_CHDET_vect             _VECTOR(11)         /* Charger Detect */
#define None_TIMER1_IC_vect_num     (12)                
#define None_TIMER1_IC_vect         _VECTOR(12)         /* Timer 1 Input capture */
#define None_TIMER1_COMPA_vect_num  (13)                
#define None_TIMER1_COMPA_vect      _VECTOR(13)         /* Timer 1 Compare Match A */
#define None_TIMER1_COMPB_vect_num  (14)                
#define None_TIMER1_COMPB_vect      _VECTOR(14)         /* Timer 1 Compare Match B */
#define None_TIMER1_OVF_vect_num    (15)                
#define None_TIMER1_OVF_vect        _VECTOR(15)         /* Timer 1 overflow */
#define None_TIMER0_IC_vect_num     (16)                
#define None_TIMER0_IC_vect         _VECTOR(16)         /* Timer 0 Input Capture */
#define None_TIMER0_COMPA_vect_num  (17)                
#define None_TIMER0_COMPA_vect      _VECTOR(17)         /* Timer 0 Comapre Match A */
#define None_TIMER0_COMPB_vect_num  (18)                
#define None_TIMER0_COMPB_vect      _VECTOR(18)         /* Timer 0 Compare Match B */
#define None_TIMER0_OVF_vect_num    (19)                
#define None_TIMER0_OVF_vect        _VECTOR(19)         /* Timer 0 Overflow */
#define None_TWIBUSCD_vect_num      (20)                
#define None_TWIBUSCD_vect          _VECTOR(20)         /* Two-Wire Bus Connect/Disconnect */
#define None_TWI_vect_num           (21)                
#define None_TWI_vect               _VECTOR(21)         /* Two-Wire Serial Interface */
#define None_SPI_STC_vect_num       (22)                
#define None_SPI_STC_vect           _VECTOR(22)         /* SPI Serial transfer complete */
#define None_VADC_vect_num          (23)                
#define None_VADC_vect              _VECTOR(23)         /* Voltage ADC Conversion Complete */
#define None_CCADC_CONV_vect_num    (24)                
#define None_CCADC_CONV_vect        _VECTOR(24)         /* Coulomb Counter ADC Conversion Complete */
#define None_CCADC_REG_CUR_vect_num (25)                
#define None_CCADC_REG_CUR_vect     _VECTOR(25)         /* Coloumb Counter ADC Regular Current */
#define None_CCADC_ACC_vect_num     (26)                
#define None_CCADC_ACC_vect         _VECTOR(26)         /* Coloumb Counter ADC Accumulator */
#define None_EE_READY_vect_num      (27)                
#define None_EE_READY_vect          _VECTOR(27)         /* EEPROM Ready */
#define None_SPM_vect_num           (28)                
#define None_SPM_vect               _VECTOR(28)         /* SPM Ready */

/* Vector Table Size */
#define _VECTOR_SIZE                (4)                 /* Size of individual vector. */
#define _VECTORS_SIZE               (29 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

